#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/blackboards/infrastructure/runs/run-uVPE7wDrDUUG5U5G

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
digitalocean_ssh_key.secondary: Refreshing state... [id=38557683]
digitalocean_ssh_key.m2: Refreshing state... [id=38210829]
digitalocean_droplet.postgres: Refreshing state... [id=359948759]
digitalocean_project.blackboards: Refreshing state... [id=d006b183-c896-4d41-a341-fb46d729eeb6]
aws_route53_zone.opentracker: Refreshing state... [id=Z03017682LQ8TW5YUFGE0]
aws_iam_user.github_actions: Refreshing state... [id=github.actions]
aws_iam_user.configuration_deployer: Refreshing state... [id=configuration.deployer]
module.postgres_backups.aws_s3_bucket.this: Refreshing state... [id=postgres-backups-tr1pjq]
module.configuration_bucket.aws_s3_bucket.this: Refreshing state... [id=configuration-sfvz2s]
aws_vpc.main: Refreshing state... [id=vpc-0d1ab7c53aec22955]
aws_key_pair.main: Refreshing state... [id=macbook-m2-pro]
module.remote_state.aws_s3_bucket.this: Refreshing state... [id=terraform-remote-state-m3rc9k]
aws_iam_user.personal: Refreshing state... [id=alex.jackson]
aws_iam_policy.iac_deployer: Refreshing state... [id=arn:aws:iam::558855412466:policy/iac-deployer-policy]
module.f2_instance.data.aws_iam_policy_document.ec2_assume_role: Refreshing...
module.f2_instance.data.aws_iam_policy_document.ec2_assume_role: Refresh complete after 0s [id=2851119427]
aws_iam_user.postgres_backups: Refreshing state... [id=postgres.backups]
aws_iam_access_key.github_actions: Refreshing state... [id=AKIAYEHTA3LZK6JIHCYE]
aws_iam_access_key.personal: Refreshing state... [id=AKIAYEHTA3LZCH5CBE4Y]
aws_iam_role.iac_deployer: Refreshing state... [id=iac-deployer]
aws_iam_user_login_profile.personal: Refreshing state... [id=alex.jackson]
module.f2_instance.aws_iam_role.this: Refreshing state... [id=main-role]
aws_iam_access_key.postgres_backups: Refreshing state... [id=AKIAYEHTA3LZFDVAEC42]
aws_iam_access_key.configuration_deployer: Refreshing state... [id=AKIAYEHTA3LZKXOXWTYC]
aws_iam_user_policy.personal: Refreshing state... [id=alex.jackson:alex.jackson.policy]
aws_iam_user_policy.github_actions: Refreshing state... [id=github.actions:github.actions.policy]
aws_iam_role_policy_attachment.iac_deployer: Refreshing state... [id=iac-deployer-20230421061924179000000001]
module.f2_instance.aws_iam_instance_profile.this: Refreshing state... [id=main-instance-profile]
aws_internet_gateway.main: Refreshing state... [id=igw-0aa2c09bec52493fc]
aws_route53_zone.internal: Refreshing state... [id=Z0474418KLUF1M8YKY2A]
aws_subnet.main: Refreshing state... [id=subnet-07936cc0e5c7d83b1]
module.f2_instance.aws_security_group.this: Refreshing state... [id=sg-084f10e5da8977ef8]
aws_route_table.gateway: Refreshing state... [id=rtb-0881a403738fea9c7]
module.f2_instance.data.aws_subnet.self: Refreshing...
aws_route_table_association.gateway: Refreshing state... [id=rtbassoc-041dbac3ebba9c5ca]
module.f2_instance.data.aws_subnet.self: Refresh complete after 0s [id=subnet-07936cc0e5c7d83b1]
module.configuration_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=configuration-sfvz2s]
aws_iam_user_policy.configuration_deployer: Refreshing state... [id=configuration.deployer:configuration.deployer.policy]
module.f2_instance.aws_iam_policy.this: Refreshing state... [id=arn:aws:iam::558855412466:policy/main-policy]
aws_iam_user_policy.postgres_backups: Refreshing state... [id=postgres.backups:postgres.backups.policy]
module.postgres_backups.aws_s3_bucket_versioning.this: Refreshing state... [id=postgres-backups-tr1pjq]
module.remote_state.aws_s3_bucket_versioning.this: Refreshing state... [id=terraform-remote-state-m3rc9k]
module.f2_instance.aws_security_group_rule.allow_outbound_http: Refreshing state... [id=sgrule-2409512323]
module.f2_instance.aws_security_group_rule.allow_outbound_postgres: Refreshing state... [id=sgrule-4081642417]
module.f2_instance.aws_security_group_rule.allow_inbound_ssh: Refreshing state... [id=sgrule-1085682246]
module.f2_instance.aws_security_group_rule.allow_outbound_https: Refreshing state... [id=sgrule-2980093754]
module.f2_instance.aws_instance.this: Refreshing state... [id=i-0bdb939a052debb4b]
module.f2_instance.aws_security_group_rule.allow_outbound_subnet_postgres: Refreshing state... [id=sgrule-934331843]
module.f2_instance.aws_security_group_rule.allow_outbound_ssh: Refreshing state... [id=sgrule-1676588476]
module.f2_instance.aws_security_group_rule.allow_inbound_https: Refreshing state... [id=sgrule-1153391225]
module.f2_instance.aws_iam_role_policy_attachment.this: Refreshing state... [id=main-role-20230829053104189100000001]
module.f2_instance.aws_eip.this: Refreshing state... [id=eipalloc-0e2eced5b3f96fdd0]
aws_route53_record.opentracker: Refreshing state... [id=Z03017682LQ8TW5YUFGE0__A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.config_bucket.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.config_bucket.aws_s3_bucket_versioning.this will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.config_bucket.random_id.this[0] will be created
  + resource "random_id" "this" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 3
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>